tap "homebrew/bundle"

brew "atuin"
brew "bash-preexec"
brew "bat"
brew "bitwarden-cli"
brew "btop"
brew "cheat"
brew "direnv"
brew "eza"
brew "fzf"
brew "gh"
brew "git"
brew "git-delta"
brew "difftastic"
brew "diff-so-fancy"
brew "glab"
brew "htop"
brew "jq"
brew "neofetch"
brew "neovim"
brew "node"
brew "python@3.12"
brew "ripgrep"
brew "rsync"
brew "rustup-init"
brew "tree-sitter"
brew "yq"
brew "zoxide"
brew "direnv"
brew "starship"

brew "broot"
