tap "homebrew/bundle"
tap "withgraphite/tap"
brew "atuin"
brew "bash-preexec"
brew "bat"
brew "btop"
brew "cheat"
brew "python@3.12"
brew "commitizen"
brew "diff-so-fancy"
brew "difftastic"
brew "direnv"
brew "eza"
brew "node"
brew "fx"
brew "fzf"
brew "gh"
brew "git"
brew "git-delta"
brew "glab"
brew "go", args: ["HEAD"]
brew "htop"
brew "jq"
brew "neofetch"
brew "tree-sitter"
brew "neovim"
brew "pre-commit"
brew "ripgrep"
brew "rm-improved"
brew "rsync"
brew "rustup-init"
brew "yq"
brew "zoxide"
brew "withgraphite/tap/graphite"
vscode "alefragnani.project-manager"
vscode "alexdauenhauer.catppuccin-noctis"
vscode "arturock.gitstash"
vscode "batisteo.vscode-django"
vscode "bierner.markdown-preview-github-styles"
vscode "bmalehorn.vscode-fish"
vscode "codeium.codeium"
vscode "codezombiech.gitignore"
vscode "codium.codium"
vscode "danielsanmedium.dscodegpt"
vscode "dbaeumer.vscode-eslint"
vscode "donjayamanne.git-extension-pack"
vscode "donjayamanne.githistory"
vscode "donjayamanne.python-environment-manager"
vscode "donjayamanne.python-extension-pack"
vscode "eamodio.gitlens"
vscode "editorconfig.editorconfig"
vscode "emeraldwalk.runonsave"
vscode "esbenp.prettier-vscode"
vscode "felipecaputo.git-project-manager"
vscode "firsttris.vscode-jest-runner"
vscode "formulahendry.docker-explorer"
vscode "foxundermoon.shell-format"
vscode "github.codespaces"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.github-vscode-theme"
vscode "github.remotehub"
vscode "github.vscode-github-actions"
vscode "github.vscode-pull-request-github"
vscode "gitlab.gitlab-workflow"
vscode "golang.go"
vscode "graphite.gti-vscode"
vscode "hashicorp.hcl"
vscode "henriiik.vscode-sort"
vscode "huizhou.githd"
vscode "jnoortheen.nix-ide"
vscode "kamadorueda.alejandra"
vscode "kdl-org.kdl"
vscode "kevinrose.vsc-python-indent"
vscode "ldez.ignore-files"
vscode "lllllllqw.jsdoc"
vscode "me-dutour-mathieu.vscode-github-actions"
vscode "mhutchie.git-graph"
vscode "mikestead.dotenv"
vscode "monokai.theme-monokai-pro-vscode"
vscode "moshfeu.diff-merge"
vscode "ms-azuretools.vscode-docker"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-python.black-formatter"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "ms-vscode.azure-repos"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-repositories"
vscode "ms-vscode.remote-server"
vscode "njpwerner.autodocstring"
vscode "orta.vscode-jest"
vscode "piousdeer.adwaita-theme"
vscode "raer0.codium-dark-syntax"
vscode "redhat.java"
vscode "redhat.vscode-yaml"
vscode "rust-lang.rust-analyzer"
vscode "sclu1034.justfile"
vscode "shaharkazaz.git-merger"
vscode "skellock.just"
vscode "tal7aouy.icons"
vscode "tamasfe.even-better-toml"
vscode "teabyii.ayu"
vscode "thertzlor.semantic-rainbow"
vscode "timonwong.shellcheck"
vscode "tyriar.sort-lines"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-test"
vscode "waderyan.gitblame"
vscode "wholroyd.jinja"
vscode "xontab.layan-theme"
vscode "xuangeaha.vsmarketplace-badges"
vscode "yzhang.markdown-all-in-one"
vscode "zhuangtongfa.material-theme"
vscode "ziyasal.vscode-open-in-github"
